app/controllers/articles_controller.rb

    def create
        @article = Article.new(
          title: params[:article][:title],
          body: params[:article][:body])
        @article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Ritviz"], ["body", "try to fix you"], ["created_at", "2020-07-03 08:19:48.583992"], ["updated_at", "2020-07-03 08:19:48.583992"]]

    def update
        @article = Article.find(params[:id])
        @article.update(title: params[:article][:title],
        body: params[:article][:body])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
UPDATE "articles" SET "body" = ?, "updated_at" = ? WHERE "articles"."id" = ?